In [1]:
#import dependencies
import pandas as pd
from pathlib import Path

In [2]:
#read in homeless csv
home_df = pd.read_csv(Path('Resources/clean_homeless.csv'))
home_df.head()

  State_Year  Year State  Count
0    2007_AK  2007    AK    224
1    2007_AK  2007    AK    696
2    2007_AK  2007    AK    278
3    2007_AK  2007    AK    187
4    2007_AK  2007    AK    842

In [3]:
#fill NaN with 0
home_df.fillna(0)

      State_Year  Year State  Count
0        2007_AK  2007    AK    224
1        2007_AK  2007    AK    696
2        2007_AK  2007    AK    278
3        2007_AK  2007    AK    187
4        2007_AK  2007    AK    842
...          ...   ...   ...    ...
86524    2016_WY  2016    WY      7
86525    2016_WY  2016    WY     31
86526    2016_WY  2016    WY      3
86527    2016_WY  2016    WY      3
86528    2016_WY  2016    WY      0

[86529 rows x 4 columns]

In [4]:
#check data types
home_df.dtypes

State_Year    object
Year           int64
State         object
Count          int64
dtype: object

In [5]:
#remove commas from Count 
#home_df['Count'] = home_df['Count'].str.replace(',','')

In [6]:
#convert Count to int
home_df['Count'] = pd.to_numeric(home_df['Count'])
home_df.dtypes

State_Year    object
Year           int64
State         object
Count          int64
dtype: object

In [7]:
#get homeless types
#homeless_measure = home_df['Measures'].unique()
#homeless_measure

In [8]:
#bin sheltered vs nonsheltered
#grouping_lists = [['Sheltered Chronically Homeless Individuals','Sheltered Homeless','Sheltered Homeless Individuals',
   #               'Sheltered Homeless People in Families','Sheltered Chronically Homeless','Sheltered Chronically Homeless People in Families',
    #              'Sheltered Homeless Veterans','Sheltered Children of Parenting Youth','Sheltered Homeless Unaccompanied Children (Under 18)',
    #              'Sheltered Homeless Unaccompanied Young Adults (Age 18-24)','Sheltered Homeless Unaccompanied Youth (Under 25)','Sheltered Parenting Youth (Under 25)',
    #              'Sheltered Parenting Youth Age 18-24','Sheltered Parenting Youth Under 18',],['Unsheltered Chronically Homeless Individuals',
    #              'Unsheltered Homeless', 'Unsheltered Homeless Individuals','Unsheltered Homeless People in Families',
    #              'Unsheltered Chronically Homeless','Unsheltered Chronically Homeless People in Families','Unsheltered Homeless Veterans',
    #              'Unsheltered Children of Parenting Youth','Unsheltered Homeless Unaccompanied Children (Under 18)',
    #              'Unsheltered Homeless Unaccompanied Young Adults (Age 18-24)','Unsheltered Homeless Unaccompanied Youth (Under 25)','Unsheltered Parenting Youth (Under 25)',
    #              'Unsheltered Parenting Youth Age 18-24','Unsheltered Parenting Youth Under 18'], ['Chronically Homeless Individuals', 'Homeless Individuals',
    #              'Homeless People in Families','Total Homeless','Chronically Homeless','Chronically Homeless People in Families', 'Homeless Veterans',
    #              'Children of Parenting Youth','Homeless Unaccompanied Children (Under 18)','Homeless Unaccompanied Young Adults (Age 18-24)','Homeless Unaccompanied Youth (Under 25)',
    #              'Parenting Youth (Under 25)', 'Parenting Youth Age 18-24','Parenting Youth Under 18',]]
#group_names = ['Sheltered', 'Unsheltered','Other']

#groups = (pd.DataFrame({'Groups':group_names, 'Measures': grouping_lists})
#         .explode('Measures')
#         .reset_index(drop=True))

#home_df = home_df.merge(groups, on='Measures', how='left')
#home_df.head()

In [9]:
#drop Measures col
#home_df = home_df.drop(columns=['Measures'])
#home_df.head()

In [10]:
#group counts
group_home_df = home_df.groupby(['State_Year','Year','State'], as_index=False).sum()
group_home_df.head()

  State_Year  Year State   Count
0    2007_AK  2007    AK    7124
1    2007_AL  2007    AL   23794
2    2007_AR  2007    AR   17048
3    2007_AZ  2007    AZ   64192
4    2007_CA  2007    CA  636626

In [11]:
#read in education csv
edu_df = pd.read_csv(Path('Resources/clean_education.csv'))
edu_df.head()

,State_Year,STATE,YEAR,TOTAL_REVENUE,TOTAL_EXPENDITURE,GRADES_9_12_G,GRADES_ALL_G
0,1992_AL,AL,1992,2678885.0,2653798.0,NaN,731634.0
1,1992_AK,AK,1992,1049591.0,972488.0,NaN,122487.0
2,1992_AZ,AZ,1992,3258079.0,3401580.0,NaN,673477.0
3,1992_AR,AR,1992,1711959.0,1743022.0,NaN,441490.0
4,1992_CA,CA,1992,26260025.0,27138832.0,NaN,5254844.0

In [12]:
#fill NaN with 0
edu_df.fillna(0)

,State_Year,STATE,YEAR,TOTAL_REVENUE,TOTAL_EXPENDITURE,GRADES_9_12_G,GRADES_ALL_G
0,1992_AL,AL,1992,2678885.0,2653798.0,0.0,731634.0
1,1992_AK,AK,1992,1049591.0,972488.0,0.0,122487.0
2,1992_AZ,AZ,1992,3258079.0,3401580.0,0.0,673477.0
3,1992_AR,AR,1992,1711959.0,1743022.0,0.0,441490.0
4,1992_CA,CA,1992,26260025.0,27138832.0,0.0,5254844.0
...,...,...,...,...,...,...,...
1710,2019_VA,VA,2019,0.0,0.0,0.0,0.0
1711,2019_WA,WA,2019,0.0,0.0,0.0,0.0
1712,2019_WEST_VIRGINIA,WEST_VIRGINIA,2019,0.0,0.0,0.0,0.0
1713,2019_WI,WI,2019,0.0,0.0,0.0,0.0
1714,2019_WY,WY,2019,0.0,0.0,0.0,0.0

In [13]:
#merge datasets
merged_df = group_home_df.merge(edu_df, on='State_Year',how='inner')
merged_df.head()

,State_Year,Year,State,Count,STATE,YEAR,TOTAL_REVENUE,TOTAL_EXPENDITURE,GRADES_9_12_G,GRADES_ALL_G
0,2007_AK,2007,AK,7124,AK,2007,1800616.0,1938755.0,42049.0,131029.0
1,2007_AL,2007,AL,23794,AL,2007,7069040.0,7196459.0,216941.0,742919.0
2,2007_AR,2007,AR,17048,AR,2007,4415981.0,4779308.0,138921.0,479016.0
3,2007_AZ,2007,AZ,64192,AZ,2007,8724434.0,8709531.0,316376.0,1087447.0
4,2007_CA,2007,CA,636626,CA,2007,72516936.0,73225422.0,2011865.0,6343471.0

In [14]:
merged_df = merged_df.drop(columns=['STATE','YEAR','State_Year'])
merged_df.head()

,Year,State,Count,TOTAL_REVENUE,TOTAL_EXPENDITURE,GRADES_9_12_G,GRADES_ALL_G
0,2007,AK,7124,1800616.0,1938755.0,42049.0,131029.0
1,2007,AL,23794,7069040.0,7196459.0,216941.0,742919.0
2,2007,AR,17048,4415981.0,4779308.0,138921.0,479016.0
3,2007,AZ,64192,8724434.0,8709531.0,316376.0,1087447.0
4,2007,CA,636626,72516936.0,73225422.0,2011865.0,6343471.0

In [15]:
merged_df = merged_df[['Year','State','TOTAL_REVENUE','TOTAL_EXPENDITURE','GRADES_9_12_G',
             'GRADES_ALL_G','Count']]
merged_df.head()

,Year,State,TOTAL_REVENUE,TOTAL_EXPENDITURE,GRADES_9_12_G,GRADES_ALL_G,Count
0,2007,AK,1800616.0,1938755.0,42049.0,131029.0,7124
1,2007,AL,7069040.0,7196459.0,216941.0,742919.0,23794
2,2007,AR,4415981.0,4779308.0,138921.0,479016.0,17048
3,2007,AZ,8724434.0,8709531.0,316376.0,1087447.0,64192
4,2007,CA,72516936.0,73225422.0,2011865.0,6343471.0,636626

In [16]:
#encode State
merged_encoded_df = pd.get_dummies(merged_df, columns=['State'])
merged_encoded_df

,Year,TOTAL_REVENUE,TOTAL_EXPENDITURE,GRADES_9_12_G,GRADES_ALL_G,Count,State_AK,State_AL,State_AR,State_AZ,...,State_SC,State_SD,State_TN,State_TX,State_UT,State_VA,State_VT,State_WA,State_WI,State_WY
0,2007,1800616.0,1938755.0,42049.0,131029.0,7124,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,2007,7069040.0,7196459.0,216941.0,742919.0,23794,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
2,2007,4415981.0,4779308.0,138921.0,479016.0,17048,0,0,1,0,...,0,0,0,0,0,0,0,0,0,0
3,2007,8724434.0,8709531.0,316376.0,1087447.0,64192,0,0,0,1,...,0,0,0,0,0,0,0,0,0,0
4,2007,72516936.0,73225422.0,2011865.0,6343471.0,636626,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
495,2016,16259274.0,16497520.0,389330.0,1287026.0,31262,0,0,0,0,...,0,0,0,0,0,1,0,0,0,0
496,2016,2112365.0,2082696.0,25573.0,88428.0,5762,0,0,0,0,...,0,0,0,0,0,0,1,0,0,0
497,2016,14964364.0,15253296.0,339349.0,1101711.0,103862,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
498,2016,11697466.0,11787535.0,262681.0,864432.0,27656,0,0,0,0,...,0,0,0,0,0,0,0,0,1,0
499,2016,2044669.0,2034229.0,26924.0,94170.0,4184,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1

In [17]:
#scale columns
def scale(val):
    return val/100

merged_encoded_df['TOTAL_REVENUE'] = merged_encoded_df['TOTAL_REVENUE'].apply(scale)
merged_encoded_df['TOTAL_EXPENDITURE'] = merged_encoded_df['TOTAL_EXPENDITURE'].apply(scale)
merged_encoded_df['GRADES_9_12_G'] = merged_encoded_df['GRADES_9_12_G'].apply(scale)
merged_encoded_df['GRADES_ALL_G'] = merged_encoded_df['GRADES_ALL_G'].apply(scale)
merged_encoded_df

,Year,TOTAL_REVENUE,TOTAL_EXPENDITURE,GRADES_9_12_G,GRADES_ALL_G,Count,State_AK,State_AL,State_AR,State_AZ,...,State_SC,State_SD,State_TN,State_TX,State_UT,State_VA,State_VT,State_WA,State_WI,State_WY
0,2007,18006.16,19387.55,420.49,1310.29,7124,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,2007,70690.40,71964.59,2169.41,7429.19,23794,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
2,2007,44159.81,47793.08,1389.21,4790.16,17048,0,0,1,0,...,0,0,0,0,0,0,0,0,0,0
3,2007,87244.34,87095.31,3163.76,10874.47,64192,0,0,0,1,...,0,0,0,0,0,0,0,0,0,0
4,2007,725169.36,732254.22,20118.65,63434.71,636626,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
495,2016,162592.74,164975.20,3893.30,12870.26,31262,0,0,0,0,...,0,0,0,0,0,1,0,0,0,0
496,2016,21123.65,20826.96,255.73,884.28,5762,0,0,0,0,...,0,0,0,0,0,0,1,0,0,0
497,2016,149643.64,152532.96,3393.49,11017.11,103862,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
498,2016,116974.66,117875.35,2626.81,8644.32,27656,0,0,0,0,...,0,0,0,0,0,0,0,0,1,0
499,2016,20446.69,20342.29,269.24,941.70,4184,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1

In [19]:
#export preprocessed data
merged_encoded_df.to_csv('Resources/homeless_edu.csv',index=False)